#DROP DATABASE STUDENT_WEBCV_GREEK;
CREATE DATABASE STUDENT_WEBCV_GREEK DEFAULT CHARACTER SET utf8 COLLATE utf8_unicode_ci;
USE STUDENT_WEBCV_GREEK;

CREATE TABLE DEPARTMENTS (DEPARTMENT VARCHAR (150) NOT NULL, FACULTY VARCHAR (150) NOT NULL, INSTITUTION VARCHAR (150) NOT NULL, PRIMARY KEY(DEPARTMENT, FACULTY, INSTITUTION));

CREATE TABLE USER (UNAME VARCHAR (14) NOT NULL, UPASS VARCHAR (20) NOT NULL, NAME VARCHAR (20) NOT NULL, SURNAME VARCHAR (25) NOT NULL, DEPARTMENT VARCHAR (150) NOT NULL, FACULTY VARCHAR (150) NOT NULL, INSTITUTION VARCHAR(150) NOT NULL, CV longtext, BIRTHDATE DATE, PRIMARY KEY(UNAME), FOREIGN KEY(DEPARTMENT, FACULTY, INSTITUTION) REFERENCES DEPARTMENTS(DEPARTMENT, FACULTY, INSTITUTION));

CREATE TABLE INTERESTS (INTEREST VARCHAR (50) NOT NULL, PRIMARY KEY(INTEREST));
CREATE TABLE STUD_INT (UNAME VARCHAR (14) NOT NULL, INTEREST VARCHAR (50) NOT NULL, PRIMARY KEY(UNAME, INTEREST), FOREIGN KEY(UNAME) REFERENCES USER(UNAME), FOREIGN KEY(INTEREST) REFERENCES INTERESTS(INTEREST));

CREATE TABLE STUD_QUOTES (Q_ID INT(8) auto_increment, UNAME VARCHAR (14) NOT NULL, QUOTE text NOT NULL, Q_DATE DATE NOT NULL, PRIMARY KEY(Q_ID), FOREIGN KEY(UNAME) REFERENCES USER(UNAME));

CREATE TABLE LANGUAGES (LANGUAGE VARCHAR (20) NOT NULL, PRIMARY KEY(LANGUAGE));
CREATE TABLE LEVELS(LEVEL VARCHAR(20), PRIMARY KEY (LEVEL));
CREATE TABLE STUD_LANG (UNAME VARCHAR (14) NOT NULL, LANGUAGE VARCHAR (20) NOT NULL, LEVEL VARCHAR(14), PRIMARY KEY(UNAME, LANGUAGE), FOREIGN KEY(UNAME) REFERENCES USER(UNAME), FOREIGN KEY(LANGUAGE) REFERENCES LANGUAGES(LANGUAGE), FOREIGN KEY(LEVEL) REFERENCES LEVELS(LEVEL));

CREATE TABLE HOBBIES (HOBBY VARCHAR (50) NOT NULL, PRIMARY KEY(HOBBY));
CREATE TABLE STUD_HOB (UNAME VARCHAR (14) NOT NULL, HOBBY VARCHAR (50) NOT NULL, PRIMARY KEY(UNAME, HOBBY), FOREIGN KEY(UNAME) REFERENCES USER(UNAME), FOREIGN KEY(HOBBY) REFERENCES HOBBIES(HOBBY));

CREATE TABLE VIDEOS (V_ID INT(8) auto_increment, UNAME VARCHAR (14), VIDEO TEXT, PRIMARY KEY(V_ID), FOREIGN KEY(UNAME) REFERENCES USER(UNAME));
CREATE TABLE PHOTOES (P_ID INT(8) auto_increment, UNAME VARCHAR (14), PHOTO LONGBLOB, PRIMARY KEY(P_ID), FOREIGN KEY(UNAME) REFERENCES USER(UNAME));

create trigger quote_date
before insert on stud_quotes
for each row
set new.q_date=curdate();

INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Ενεργειακής Τεχνολογίας T.E.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ηλεκτρονικών Μηχανικών T.E.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ναυπηγών Μηχανικών T.E.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Πληροφορικής T.E.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Βιοϊατρικής Τεχνολογίας T.E.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Πολιτικών Μηχανικών και Μηχανικών Τοπογραφίας & Γεωπληροφορικής T.E.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Εμπορίας και Διαφήμισης', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Βιβλιοθηκονομίας και Συστημάτων Πληροφόρησης', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Αισθητικής και Κοσμητολογίας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Προσχολικής Αγωγής', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Δημόσιας και Κοινοτικής Υγείας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Εργοθεραπείας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ιατρικών Εργαστηρίων', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Κοινωνικής Εργασίας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μαιευτικής', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Νοσηλευτικής', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Οδοντικής Τεχνολογίας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Οπτικής και Οπτομετρίας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ραδιολογίας και Ακτινολογίας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Φυσιοθεραπείας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολογίας Τροφίμων', 'Σχολή Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Οινολογίας και Τεχνολογίας Ποτών', 'Σχολή Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Γραφιστικής-Κατεύθυνση Γραφιστικής', 'Σχολή Καλλιτεχνικών Σπουδών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Γραφιστικής-Κατεύθυνση Τεχνολογίας Γραφικών Τεχνών', 'Σχολή Καλλιτεχνικών Σπουδών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Εσωτερικής Αρχιτεκτονικής,Διακόσμησης και Σχεδιασμού Αντικειμένων', 'Σχολή Καλλιτεχνικών Σπουδών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Συντήρησης Αρχαιοτήτων και Έργων Τέχνης', 'Σχολή Καλλιτεχνικών Σπουδών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Φωτογραφίας και Οπτικοακουστικών Τεχνών', 'Σχολή Καλλιτεχνικών Σπουδών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Αθήνας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ηλεκτρολόγων Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πειραιά');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Αυτοματισμού Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πειραιά');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ηλεκτρονικών Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πειραιά');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Ηλεκτρονικών Υπολογιστικών Συστημάτων Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πειραιά');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Κλωστοϋφαντουργών Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πειραιά');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανολόγων Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πειραιά');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Πολιτικών Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πειραιά');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πειραιά');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογιστικής και Χρηματοοικονομικής', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πειραιά');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ηλεκτρολόγων Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Μηχανικών Περιβάλλοντος και Μηχανικών Αντιρρύπανσης Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Μηχανολόγων Μηχανικών και Βιομηχανικού Σχεδιασμού Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Μηχανικών Πληροφορικής Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Ψηφιακών Μέσων και Επικοινωνίας Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Διοίκησης Επιχειρήσεων (Κοζάνη)', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Διοίκησης Επιχειρήσεων (Γρεβενά)', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Λογιστικής και Χρηματοοικονομικής', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Διεθνούς Εμπορίου', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μαιευτικής', 'Σχολή Επαγγελμάτων Υγείας Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολόγων Γεωπόνων', 'Σχολή Τεχνολογίας Γεωπονίας & Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ηπείρου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογιστικής και Χρηματοοικονομικής', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ηπείρου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Προσχολικής Αγωγής', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ηπείρου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογοθεραπείας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ηπείρου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Νοσηλευτικής', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ηπείρου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολόγων Γεωπόνων', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ηπείρου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λαϊκής και Παραδοσιακής Μουσικής', 'Σχολή Καλλιτεχνικών Σπουδών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ηπείρου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Πληροφορικής Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ηπείρου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διατροφής και Διαιτολογίας', 'Σχολή Τεχνολογίας Γεωπονίας & Τεχνολογίας Τροφίμων & Διατροφής', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολογίας Τροφίμων', 'Σχολή Τεχνολογίας Γεωπονίας & Τεχνολογίας Τροφίμων & Διατροφής', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολόγων Γεωπόνων', 'Σχολή Τεχνολογίας Γεωπονίας & Τεχνολογίας Τροφίμων & Διατροφής', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Προσχολικής Αγωγής', 'Σχολή Επαγγελμάτων Υγείας & Πρόνοιας', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Νοσηλευτικής', 'Σχολή Επαγγελμάτων Υγείας & Πρόνοιας', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μαιευτικής', 'Σχολή Επαγγελμάτων Υγείας & Πρόνοιας', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ιατρικών Εργαστηρίων', 'Σχολή Επαγγελμάτων Υγείας & Πρόνοιας', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Φυσικοθεραπείας', 'Σχολή Επαγγελμάτων Υγείας & Πρόνοιας', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Αισθητικής & Κοσμητολογίας', 'Σχολή Επαγγελμάτων Υγείας & Πρόνοιας', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Πολιτικών Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ηλεκτρονικών Μηχανικών', 'Σχολή Τεχνολογικών Εφαρμογών', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Πληροφορικής', 'Σχολή Τεχνολογικών Εφαρμογών', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Αυτοματισμού', 'Σχολή Τεχνολογικών Εφαρμογών', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανολόγων Οχημάτων', 'Σχολή Τεχνολογικών Εφαρμογών', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων', 'Σχολή Διοίκησης & Οικονομίας', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογιστικής & Χρηματοοικονομικής', 'Σχολή Διοίκησης & Οικονομίας', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Βιβλιοθηκονομίας & Συστημάτων Πληροφόρησης', 'Σχολή Διοίκησης & Οικονομίας', 'Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ηλεκτρολογίας', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ηλεκτρολόγων Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ηλεκτρονικών Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Αυτοματισμου Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Τεχνολογίας Αεροσκαφών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Πληροφορικής Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανολόγων Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Νοσηλευτικής', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Φυσικοθεραπείας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης, Οικονομίας και Επικοινωνίας Πολιτιστικών και Τουριστικών Μονάδων', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Συστημάτων Εφοδιασμού', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Εμπορίας και Διαφήμισης', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογιστικής και Χρηματοοικονομικής', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Δασοπονίας και Διαχείρισης Φυσικού Περιβάλλοντος', 'Σχολή Τεχνολογίας Γεωπονίας, Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Στερεάς Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Πολιτικών Μηχανικών Τ.Ε. (Τρίκαλα)', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ηλεκτρολόγων Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Πληροφορικής Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανολόγων Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Πολιτικών Μηχανικών Τ.Ε. (Λάρισα)', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Σχεδιασμού και Τεχνολογίας Ξύλου και Επίπλου Τ.Ε. (Καρδίτσα)', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογιστικής και Χρηματοοικονομικής', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικής Βιοσυστημάτων', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολογίας Τροφίμων (Καρδίτσα)', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Tμήμα Διατροφής και Διαιτολογίας (Καρδίτσα)', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολόγων Γεωπόνων', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ιατρικών Eργαστηρίων', 'Σχολή Επαγγελμάτων Υγείας - Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Νοσηλευτικής', 'Σχολή Επαγγελμάτων Υγείας - Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Δασοπονίας και Διαχείρισης Φυσικού Περιβάλλοντος', 'Πρώην Παράρτημα Καρδίτσας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ψηφιακών Μέσων & Επικοινωνίας', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ιονίων Νήσων');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολόγων Περιβάλλοντος Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ιονίων Νήσων');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολογίας Ήχου και Μουσικών Οργάνων', 'Σχολή Μουσικής Τεχνολογίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ιονίων Νήσων');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολογίας Τροφίμων', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων & Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ιονίων Νήσων');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ιονίων Νήσων');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Τεχνολογίας Πετρελαίου και Φυσικού Αερίου', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ανατολικής Μακεδονίας και Θράκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ηλεκτρολόγων Μηχανικών', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ανατολικής Μακεδονίας και Θράκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Πληροφορικής', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ανατολικής Μακεδονίας και Θράκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογιστικής και Χρηματοοικονομικής', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ανατολικής Μακεδονίας και Θράκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ανατολικής Μακεδονίας και Θράκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Δασοπονίας και Διαχείρισης Φυσικού Περιβάλλοντος', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ανατολικής Μακεδονίας και Θράκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Αρχιτεκτονικής Τοπίου', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ανατολικής Μακεδονίας και Θράκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Οινολογίας και Τεχνολογίας Ποτών', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ανατολικής Μακεδονίας και Θράκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Νοσηλευτικής', 'Σχολή Επαγγελμάτων Υγείας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Ανατολικής Μακεδονίας και Θράκης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Πληροφορικής Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πελοποννήσου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογοθεραπείας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πελοποννήσου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολόγων Γεωπόνων', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων & Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πελοποννήσου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολογίας Τροφίμων', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων & Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πελοποννήσου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων και Οργανισμών', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πελοποννήσου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογιστικής και Χρηματοοικονομικής', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Πελοποννήσου');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων (Ηράκλειο)', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων (Άγιος Νικόλαος)', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Εμπορίας και Διαφήμισης', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογιστικής και Χρηματοικονομικής', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Κοινωνικής Εργασίας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Νοσηλευτικής', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ηλεκτρονικών Μηχανικών', 'Σχολή Εφαρμοσμένων Επιστημών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Μουσικής Τεχνολογίας και Ακουστικής', 'Σχολή Εφαρμοσμένων Επιστημών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Φυσικών Πόρων και Περιβάλλοντος', 'Σχολή Εφαρμοσμένων Επιστημών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διατροφής και Διαιτολογίας', 'Σχολή Τεχνολογίας Γεωπονίας & Τεχνολογίας Τροφίμων', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολόγων Γεωπόνων', 'Σχολή Τεχνολογίας Γεωπονίας & Τεχνολογίας Τροφίμων', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ηλεκτρολόγων Μηχανικών', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Πληροφορικής', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανολόγων Μηχανικών', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Πολιτικών Δομικών Έργων', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κρήτης');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολογίας Αλιείας - Υδατοκαλλιεργειών', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανολογίας και Υδάτινων Πόρων', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τεχνολόγων Γεωπόνων', 'Σχολή Τεχνολογίας Γεωπονίας και Τεχνολογίας Τροφίμων και Διατροφής', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων (Μεσολόγγι)', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων (Πάτρα)', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης, Οικονομίας και Επικοινωνίας Πολιτιστικών και Τουριστικών Μονάδων', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογιστικής', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογιστικής και Χρηματοοικονομικής', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Πληροφορικής και Μέσων Μαζικής Ενημέρωσης', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Τουριστικών Επιχειρήσεων', 'Σχολή Διοίκησης και Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Κοινωνικής Εργασίας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Νοσηλευτικής', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογοθεραπείας', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Φυσικοθεραπείας (Αίγιο)', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Οπτικής - Οπτομετρίας (Αίγιο)', 'Σχολή Επαγγελμάτων Υγείας και Πρόνοιας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Ηλεκτρολόγων Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Πληροφορικής Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανολόγων Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Πολιτικών Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Δυτικής Ελλάδας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανολόγων Μηχανικών Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κεντρικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Πολιτικών Μηχανικών Τ.Ε. και Μηχανικών Τοπογραφίας & Γεωπληροφορικής Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κεντρικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Μηχανικών Πληροφορικής Τ.Ε.', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κεντρικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Σχεδιασμού και Τεχνολογίας Ένδυσης (Κιλκίς)', 'Σχολή Τεχνολογικών Εφαρμογών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κεντρικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Επιχειρήσεων', 'Σχολή Διοίκησης & Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κεντρικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Λογιστικής και Χρηματοοικονομικής', 'Σχολή Διοίκησης & Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κεντρικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Διοίκησης Συστημάτων Εφοδιασμού (Κατερίνη)', 'Σχολή Διοίκησης & Οικονομίας', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κεντρικής Μακεδονίας');
INSERT INTO DEPARTMENTS
VALUES('Τμήμα Εσωτερικής Αρχιτεκτονικής, Διακόσμησης και Σχεδιασμού Αντικειμένων', 'Πρώην Σχολή Γραφικών Τεχνών και Καλλιτεχνικών Σπουδών', 'Τεχνολογικό Εκπαιδευτικό Ίδρυμα Κεντρικής Μακεδονίας');

INSERT INTO INTERESTS
VALUES('Database');
INSERT INTO INTERESTS
VALUES('Web programming');
INSERT INTO INTERESTS
VALUES('Human Computer Interaction');
INSERT INTO INTERESTS
VALUES('Data Mining');
INSERT INTO INTERESTS
VALUES('Software Engineering');
INSERT INTO INTERESTS
VALUES('Information Retrieval');
INSERT INTO INTERESTS
VALUES('Software Quality');
INSERT INTO INTERESTS
VALUES('e-commerce');
INSERT INTO INTERESTS
VALUES('Management Information Systems');
INSERT INTO INTERESTS
VALUES('Information Systems');

INSERT INTO LANGUAGES
VALUES('Αγγλικά');
INSERT INTO LANGUAGES
VALUES('Γερμανικά');
INSERT INTO LANGUAGES
VALUES('Ιταλικά');
INSERT INTO LANGUAGES
VALUES('Ισπανικά');
INSERT INTO LANGUAGES
VALUES('Κινέζικα');
INSERT INTO LANGUAGES
VALUES('Αραβικά');
INSERT INTO LANGUAGES
VALUES('Ρώσικα');

INSERT INTO LEVELS
VALUES('Elementary');
INSERT INTO LEVELS
VALUES('Intermediate');
INSERT INTO LEVELS
VALUES('Advanced');
INSERT INTO LEVELS
VALUES('Proficient');

INSERT INTO HOBBIES
VALUES('Χορός'); 
INSERT INTO HOBBIES
VALUES('Ζωγραφική-Σχέδιο');
INSERT INTO HOBBIES
VALUES('Διάβασμα'); 
INSERT INTO HOBBIES
VALUES('Ταξίδια');  
INSERT INTO HOBBIES
VALUES('Εθελοντισμός'); 
INSERT INTO HOBBIES
VALUES('Μουσική'); 
INSERT INTO HOBBIES
VALUES('Κηπουρική'); 
INSERT INTO HOBBIES
VALUES('Κολύμπι'); 
INSERT INTO HOBBIES
VALUES('Σκι'); 
INSERT INTO HOBBIES
VALUES('Ψάρεμα'); 
INSERT INTO HOBBIES
VALUES('Κυνήγι'); 
INSERT INTO HOBBIES
VALUES('Ποδηλασία'); 
INSERT INTO HOBBIES
VALUES('Γυμναστική'); 
INSERT INTO HOBBIES
VALUES('Τένις'); 
INSERT INTO HOBBIES
VALUES('Ποδόσφαιρο'); 
INSERT INTO HOBBIES
VALUES('Μπάσκετ'); 
INSERT INTO HOBBIES
VALUES('Βόλεϊ'); 
INSERT INTO HOBBIES
VALUES('Κέντημα-Πλέξιμο'); 




 









